ataradov/mcu-starter-projects/samg53/include/component/uart.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UART_SR_OFFSET                      (0x14)                                        /**<  (UART_SR) Status Register  Offset */

#define UART_SR_RXRDY_Pos                   0                                              /**< (UART_SR) Receiver Ready Position */
#define UART_SR_RXRDY_Msk                   (_U_(0x1) << UART_SR_RXRDY_Pos)                /**< (UART_SR) Receiver Ready Mask */
#define UART_SR_RXRDY                       UART_SR_RXRDY_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_SR_RXRDY_Msk instead */
#define UART_SR_TXRDY_Pos                   1                                              /**< (UART_SR) Transmitter Ready Position */
#define UART_SR_TXRDY_Msk                   (_U_(0x1) << UART_SR_TXRDY_Pos)                /**< (UART_SR) Transmitter Ready Mask */
#define UART_SR_TXRDY                       UART_SR_TXRDY_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_SR_TXRDY_Msk instead */
#define UART_SR_ENDRX_Pos                   3                                              /**< (UART_SR) End of Receiver Transfer Position */
#define UART_SR_ENDRX_Msk                   (_U_(0x1) << UART_SR_ENDRX_Pos)                /**< (UART_SR) End of Receiver Transfer Mask */
#define UART_SR_ENDRX                       UART_SR_ENDRX_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_SR_ENDRX_Msk instead */
#define UART_SR_ENDTX_Pos                   4                                              /**< (UART_SR) End of Transmitter Transfer Position */
#define UART_SR_ENDTX_Msk                   (_U_(0x1) << UART_SR_ENDTX_Pos)                /**< (UART_SR) End of Transmitter Transfer Mask */
#define UART_SR_ENDTX                       UART_SR_ENDTX_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_SR_ENDTX_Msk instead */
#define UART_SR_OVRE_Pos                    5                                              /**< (UART_SR) Overrun Error Position */
#define UART_SR_OVRE_Msk                    (_U_(0x1) << UART_SR_OVRE_Pos)                 /**< (UART_SR) Overrun Error Mask */
#define UART_SR_OVRE                        UART_SR_OVRE_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_SR_OVRE_Msk instead */
#define UART_SR_FRAME_Pos                   6                                              /**< (UART_SR) Framing Error Position */
#define UART_SR_FRAME_Msk                   (_U_(0x1) << UART_SR_FRAME_Pos)                /**< (UART_SR) Framing Error Mask */
#define UART_SR_FRAME                       UART_SR_FRAME_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_SR_FRAME_Msk instead */
#define UART_SR_PARE_Pos                    7                                              /**< (UART_SR) Parity Error Position */
#define UART_SR_PARE_Msk                    (_U_(0x1) << UART_SR_PARE_Pos)                 /**< (UART_SR) Parity Error Mask */
#define UART_SR_PARE                        UART_SR_PARE_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_SR_PARE_Msk instead */
#define UART_SR_TXEMPTY_Pos                 9                                              /**< (UART_SR) Transmitter Empty Position */
#define UART_SR_TXEMPTY_Msk                 (_U_(0x1) << UART_SR_TXEMPTY_Pos)              /**< (UART_SR) Transmitter Empty Mask */
#define UART_SR_TXEMPTY                     UART_SR_TXEMPTY_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_SR_TXEMPTY_Msk instead */
#define UART_SR_TXBUFE_Pos                  11                                             /**< (UART_SR) Transmission Buffer Empty Position */
#define UART_SR_TXBUFE_Msk                  (_U_(0x1) << UART_SR_TXBUFE_Pos)               /**< (UART_SR) Transmission Buffer Empty Mask */
#define UART_SR_TXBUFE                      UART_SR_TXBUFE_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_SR_TXBUFE_Msk instead */
#define UART_SR_RXBUFF_Pos                  12                                             /**< (UART_SR) Receive Buffer Full Position */
#define UART_SR_RXBUFF_Msk                  (_U_(0x1) << UART_SR_RXBUFF_Pos)               /**< (UART_SR) Receive Buffer Full Mask */
#define UART_SR_RXBUFF                      UART_SR_RXBUFF_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_SR_RXBUFF_Msk instead */
#define UART_SR_CMP_Pos                     15                                             /**< (UART_SR) Comparison Match Position */
#define UART_SR_CMP_Msk                     (_U_(0x1) << UART_SR_CMP_Pos)                  /**< (UART_SR) Comparison Match Mask */
#define UART_SR_CMP                         UART_SR_CMP_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_SR_CMP_Msk instead */
#define UART_SR_MASK                        _U_(0x9AFB)                                    /**< \deprecated (UART_SR) Register MASK  (Use UART_SR_Msk instead)  */
#define UART_SR_Msk                         _U_(0x9AFB)                                    /**< (UART_SR) Register Mask  */


/* -------- UART_RHR : (UART Offset: 0x18) (R/ 32) Receive Holding Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXCHR:8;                   /**< bit:   0..7  Received Character                       */
    uint32_t :24;                       /**< bit:  8..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} UART_RHR_Type;
