ataradov/mcu-starter-projects/samg53/include/component/uart.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UART_WPMR_OFFSET                    (0xE4)                                        /**<  (UART_WPMR) Write Protection Mode Register  Offset */

#define UART_WPMR_WPEN_Pos                  0                                              /**< (UART_WPMR) Write Protection Enable Position */
#define UART_WPMR_WPEN_Msk                  (_U_(0x1) << UART_WPMR_WPEN_Pos)               /**< (UART_WPMR) Write Protection Enable Mask */
#define UART_WPMR_WPEN                      UART_WPMR_WPEN_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_WPMR_WPEN_Msk instead */
#define UART_WPMR_WPKEY_Pos                 8                                              /**< (UART_WPMR) Write Protection Key Position */
#define UART_WPMR_WPKEY_Msk                 (_U_(0xFFFFFF) << UART_WPMR_WPKEY_Pos)         /**< (UART_WPMR) Write Protection Key Mask */
#define UART_WPMR_WPKEY(value)              (UART_WPMR_WPKEY_Msk & ((value) << UART_WPMR_WPKEY_Pos))
#define   UART_WPMR_WPKEY_PASSWD_Val        _U_(0x554152)                                  /**< (UART_WPMR) Writing any other value in this field aborts the write operation.Always reads as 0.  */
#define UART_WPMR_WPKEY_PASSWD              (UART_WPMR_WPKEY_PASSWD_Val << UART_WPMR_WPKEY_Pos)  /**< (UART_WPMR) Writing any other value in this field aborts the write operation.Always reads as 0. Position  */
#define UART_WPMR_MASK                      _U_(0xFFFFFF01)                                /**< \deprecated (UART_WPMR) Register MASK  (Use UART_WPMR_Msk instead)  */
#define UART_WPMR_Msk                       _U_(0xFFFFFF01)                                /**< (UART_WPMR) Register Mask  */


/* -------- UART_RPR : (UART Offset: 0x100) (R/W 32) Receive Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXPTR:32;                  /**< bit:  0..31  Receive Pointer Register                 */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} UART_RPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UART_RPR_OFFSET                     (0x100)                                       /**<  (UART_RPR) Receive Pointer Register  Offset */

#define UART_RPR_RXPTR_Pos                  0                                              /**< (UART_RPR) Receive Pointer Register Position */
#define UART_RPR_RXPTR_Msk                  (_U_(0xFFFFFFFF) << UART_RPR_RXPTR_Pos)        /**< (UART_RPR) Receive Pointer Register Mask */
#define UART_RPR_RXPTR(value)               (UART_RPR_RXPTR_Msk & ((value) << UART_RPR_RXPTR_Pos))
#define UART_RPR_MASK                       _U_(0xFFFFFFFF)                                /**< \deprecated (UART_RPR) Register MASK  (Use UART_RPR_Msk instead)  */
#define UART_RPR_Msk                        _U_(0xFFFFFFFF)                                /**< (UART_RPR) Register Mask  */


/* -------- UART_RCR : (UART Offset: 0x104) (R/W 32) Receive Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXCTR:16;                  /**< bit:  0..15  Receive Counter Register                 */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} UART_RCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UART_RCR_OFFSET                     (0x104)                                       /**<  (UART_RCR) Receive Counter Register  Offset */

#define UART_RCR_RXCTR_Pos                  0                                              /**< (UART_RCR) Receive Counter Register Position */
#define UART_RCR_RXCTR_Msk                  (_U_(0xFFFF) << UART_RCR_RXCTR_Pos)            /**< (UART_RCR) Receive Counter Register Mask */
#define UART_RCR_RXCTR(value)               (UART_RCR_RXCTR_Msk & ((value) << UART_RCR_RXCTR_Pos))
#define UART_RCR_MASK                       _U_(0xFFFF)                                    /**< \deprecated (UART_RCR) Register MASK  (Use UART_RCR_Msk instead)  */
#define UART_RCR_Msk                        _U_(0xFFFF)                                    /**< (UART_RCR) Register Mask  */


/* -------- UART_TPR : (UART Offset: 0x108) (R/W 32) Transmit Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXPTR:32;                  /**< bit:  0..31  Transmit Counter Register                */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} UART_TPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UART_TPR_OFFSET                     (0x108)                                       /**<  (UART_TPR) Transmit Pointer Register  Offset */

#define UART_TPR_TXPTR_Pos                  0                                              /**< (UART_TPR) Transmit Counter Register Position */
#define UART_TPR_TXPTR_Msk                  (_U_(0xFFFFFFFF) << UART_TPR_TXPTR_Pos)        /**< (UART_TPR) Transmit Counter Register Mask */
#define UART_TPR_TXPTR(value)               (UART_TPR_TXPTR_Msk & ((value) << UART_TPR_TXPTR_Pos))
#define UART_TPR_MASK                       _U_(0xFFFFFFFF)                                /**< \deprecated (UART_TPR) Register MASK  (Use UART_TPR_Msk instead)  */
#define UART_TPR_Msk                        _U_(0xFFFFFFFF)                                /**< (UART_TPR) Register Mask  */


/* -------- UART_TCR : (UART Offset: 0x10c) (R/W 32) Transmit Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXCTR:16;                  /**< bit:  0..15  Transmit Counter Register                */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} UART_TCR_Type;
