ataradov/mcu-starter-projects/samg53/include/component/uart.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UART_TCR_OFFSET                     (0x10C)                                       /**<  (UART_TCR) Transmit Counter Register  Offset */

#define UART_TCR_TXCTR_Pos                  0                                              /**< (UART_TCR) Transmit Counter Register Position */
#define UART_TCR_TXCTR_Msk                  (_U_(0xFFFF) << UART_TCR_TXCTR_Pos)            /**< (UART_TCR) Transmit Counter Register Mask */
#define UART_TCR_TXCTR(value)               (UART_TCR_TXCTR_Msk & ((value) << UART_TCR_TXCTR_Pos))
#define UART_TCR_MASK                       _U_(0xFFFF)                                    /**< \deprecated (UART_TCR) Register MASK  (Use UART_TCR_Msk instead)  */
#define UART_TCR_Msk                        _U_(0xFFFF)                                    /**< (UART_TCR) Register Mask  */


/* -------- UART_RNPR : (UART Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXNPTR:32;                 /**< bit:  0..31  Receive Next Pointer                     */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} UART_RNPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UART_RNPR_OFFSET                    (0x110)                                       /**<  (UART_RNPR) Receive Next Pointer Register  Offset */

#define UART_RNPR_RXNPTR_Pos                0                                              /**< (UART_RNPR) Receive Next Pointer Position */
#define UART_RNPR_RXNPTR_Msk                (_U_(0xFFFFFFFF) << UART_RNPR_RXNPTR_Pos)      /**< (UART_RNPR) Receive Next Pointer Mask */
#define UART_RNPR_RXNPTR(value)             (UART_RNPR_RXNPTR_Msk & ((value) << UART_RNPR_RXNPTR_Pos))
#define UART_RNPR_MASK                      _U_(0xFFFFFFFF)                                /**< \deprecated (UART_RNPR) Register MASK  (Use UART_RNPR_Msk instead)  */
#define UART_RNPR_Msk                       _U_(0xFFFFFFFF)                                /**< (UART_RNPR) Register Mask  */


/* -------- UART_RNCR : (UART Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXNCTR:16;                 /**< bit:  0..15  Receive Next Counter                     */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} UART_RNCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UART_RNCR_OFFSET                    (0x114)                                       /**<  (UART_RNCR) Receive Next Counter Register  Offset */

#define UART_RNCR_RXNCTR_Pos                0                                              /**< (UART_RNCR) Receive Next Counter Position */
#define UART_RNCR_RXNCTR_Msk                (_U_(0xFFFF) << UART_RNCR_RXNCTR_Pos)          /**< (UART_RNCR) Receive Next Counter Mask */
#define UART_RNCR_RXNCTR(value)             (UART_RNCR_RXNCTR_Msk & ((value) << UART_RNCR_RXNCTR_Pos))
#define UART_RNCR_MASK                      _U_(0xFFFF)                                    /**< \deprecated (UART_RNCR) Register MASK  (Use UART_RNCR_Msk instead)  */
#define UART_RNCR_Msk                       _U_(0xFFFF)                                    /**< (UART_RNCR) Register Mask  */


/* -------- UART_TNPR : (UART Offset: 0x118) (R/W 32) Transmit Next Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXNPTR:32;                 /**< bit:  0..31  Transmit Next Pointer                    */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} UART_TNPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UART_TNPR_OFFSET                    (0x118)                                       /**<  (UART_TNPR) Transmit Next Pointer Register  Offset */

#define UART_TNPR_TXNPTR_Pos                0                                              /**< (UART_TNPR) Transmit Next Pointer Position */
#define UART_TNPR_TXNPTR_Msk                (_U_(0xFFFFFFFF) << UART_TNPR_TXNPTR_Pos)      /**< (UART_TNPR) Transmit Next Pointer Mask */
#define UART_TNPR_TXNPTR(value)             (UART_TNPR_TXNPTR_Msk & ((value) << UART_TNPR_TXNPTR_Pos))
#define UART_TNPR_MASK                      _U_(0xFFFFFFFF)                                /**< \deprecated (UART_TNPR) Register MASK  (Use UART_TNPR_Msk instead)  */
#define UART_TNPR_Msk                       _U_(0xFFFFFFFF)                                /**< (UART_TNPR) Register Mask  */


/* -------- UART_TNCR : (UART Offset: 0x11c) (R/W 32) Transmit Next Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXNCTR:16;                 /**< bit:  0..15  Transmit Counter Next                    */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} UART_TNCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UART_TNCR_OFFSET                    (0x11C)                                       /**<  (UART_TNCR) Transmit Next Counter Register  Offset */

#define UART_TNCR_TXNCTR_Pos                0                                              /**< (UART_TNCR) Transmit Counter Next Position */
#define UART_TNCR_TXNCTR_Msk                (_U_(0xFFFF) << UART_TNCR_TXNCTR_Pos)          /**< (UART_TNCR) Transmit Counter Next Mask */
#define UART_TNCR_TXNCTR(value)             (UART_TNCR_TXNCTR_Msk & ((value) << UART_TNCR_TXNCTR_Pos))
#define UART_TNCR_MASK                      _U_(0xFFFF)                                    /**< \deprecated (UART_TNCR) Register MASK  (Use UART_TNCR_Msk instead)  */
#define UART_TNCR_Msk                       _U_(0xFFFF)                                    /**< (UART_TNCR) Register Mask  */


