ataradov/mcu-starter-projects/samg53/include/component/uart.h
/* -------- UART_PTCR : (UART Offset: 0x120) (/W 32) Transfer Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXTEN:1;                   /**< bit:      0  Receiver Transfer Enable                 */
    uint32_t RXTDIS:1;                  /**< bit:      1  Receiver Transfer Disable                */
    uint32_t :6;                        /**< bit:   2..7  Reserved */
    uint32_t TXTEN:1;                   /**< bit:      8  Transmitter Transfer Enable              */
    uint32_t TXTDIS:1;                  /**< bit:      9  Transmitter Transfer Disable             */
    uint32_t :6;                        /**< bit: 10..15  Reserved */
    uint32_t RXCBEN:1;                  /**< bit:     16  Receiver Circular Buffer Enable          */
    uint32_t RXCBDIS:1;                 /**< bit:     17  Receiver Circular Buffer Disable         */
    uint32_t TXCBEN:1;                  /**< bit:     18  Transmitter Circular Buffer Enable       */
    uint32_t TXCBDIS:1;                 /**< bit:     19  Transmitter Circular Buffer Disable      */
    uint32_t :4;                        /**< bit: 20..23  Reserved */
    uint32_t ERRCLR:1;                  /**< bit:     24  Transfer Bus Error Clear                 */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} UART_PTCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UART_PTCR_OFFSET                    (0x120)                                       /**<  (UART_PTCR) Transfer Control Register  Offset */

#define UART_PTCR_RXTEN_Pos                 0                                              /**< (UART_PTCR) Receiver Transfer Enable Position */
#define UART_PTCR_RXTEN_Msk                 (_U_(0x1) << UART_PTCR_RXTEN_Pos)              /**< (UART_PTCR) Receiver Transfer Enable Mask */
#define UART_PTCR_RXTEN                     UART_PTCR_RXTEN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_PTCR_RXTEN_Msk instead */
#define UART_PTCR_RXTDIS_Pos                1                                              /**< (UART_PTCR) Receiver Transfer Disable Position */
#define UART_PTCR_RXTDIS_Msk                (_U_(0x1) << UART_PTCR_RXTDIS_Pos)             /**< (UART_PTCR) Receiver Transfer Disable Mask */
#define UART_PTCR_RXTDIS                    UART_PTCR_RXTDIS_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_PTCR_RXTDIS_Msk instead */
#define UART_PTCR_TXTEN_Pos                 8                                              /**< (UART_PTCR) Transmitter Transfer Enable Position */
#define UART_PTCR_TXTEN_Msk                 (_U_(0x1) << UART_PTCR_TXTEN_Pos)              /**< (UART_PTCR) Transmitter Transfer Enable Mask */
#define UART_PTCR_TXTEN                     UART_PTCR_TXTEN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_PTCR_TXTEN_Msk instead */
#define UART_PTCR_TXTDIS_Pos                9                                              /**< (UART_PTCR) Transmitter Transfer Disable Position */
#define UART_PTCR_TXTDIS_Msk                (_U_(0x1) << UART_PTCR_TXTDIS_Pos)             /**< (UART_PTCR) Transmitter Transfer Disable Mask */
#define UART_PTCR_TXTDIS                    UART_PTCR_TXTDIS_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_PTCR_TXTDIS_Msk instead */
#define UART_PTCR_RXCBEN_Pos                16                                             /**< (UART_PTCR) Receiver Circular Buffer Enable Position */
#define UART_PTCR_RXCBEN_Msk                (_U_(0x1) << UART_PTCR_RXCBEN_Pos)             /**< (UART_PTCR) Receiver Circular Buffer Enable Mask */
#define UART_PTCR_RXCBEN                    UART_PTCR_RXCBEN_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_PTCR_RXCBEN_Msk instead */
#define UART_PTCR_RXCBDIS_Pos               17                                             /**< (UART_PTCR) Receiver Circular Buffer Disable Position */
#define UART_PTCR_RXCBDIS_Msk               (_U_(0x1) << UART_PTCR_RXCBDIS_Pos)            /**< (UART_PTCR) Receiver Circular Buffer Disable Mask */
#define UART_PTCR_RXCBDIS                   UART_PTCR_RXCBDIS_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_PTCR_RXCBDIS_Msk instead */
#define UART_PTCR_TXCBEN_Pos                18                                             /**< (UART_PTCR) Transmitter Circular Buffer Enable Position */
#define UART_PTCR_TXCBEN_Msk                (_U_(0x1) << UART_PTCR_TXCBEN_Pos)             /**< (UART_PTCR) Transmitter Circular Buffer Enable Mask */
#define UART_PTCR_TXCBEN                    UART_PTCR_TXCBEN_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_PTCR_TXCBEN_Msk instead */
#define UART_PTCR_TXCBDIS_Pos               19                                             /**< (UART_PTCR) Transmitter Circular Buffer Disable Position */
#define UART_PTCR_TXCBDIS_Msk               (_U_(0x1) << UART_PTCR_TXCBDIS_Pos)            /**< (UART_PTCR) Transmitter Circular Buffer Disable Mask */
#define UART_PTCR_TXCBDIS                   UART_PTCR_TXCBDIS_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_PTCR_TXCBDIS_Msk instead */
#define UART_PTCR_ERRCLR_Pos                24                                             /**< (UART_PTCR) Transfer Bus Error Clear Position */
#define UART_PTCR_ERRCLR_Msk                (_U_(0x1) << UART_PTCR_ERRCLR_Pos)             /**< (UART_PTCR) Transfer Bus Error Clear Mask */
#define UART_PTCR_ERRCLR                    UART_PTCR_ERRCLR_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_PTCR_ERRCLR_Msk instead */
#define UART_PTCR_MASK                      _U_(0x10F0303)                                 /**< \deprecated (UART_PTCR) Register MASK  (Use UART_PTCR_Msk instead)  */
#define UART_PTCR_Msk                       _U_(0x10F0303)                                 /**< (UART_PTCR) Register Mask  */


/* -------- UART_PTSR : (UART Offset: 0x124) (R/ 32) Transfer Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXTEN:1;                   /**< bit:      0  Receiver Transfer Enable                 */
    uint32_t :7;                        /**< bit:   1..7  Reserved */
    uint32_t TXTEN:1;                   /**< bit:      8  Transmitter Transfer Enable              */
    uint32_t :7;                        /**< bit:  9..15  Reserved */
    uint32_t RXCBEN:1;                  /**< bit:     16  Receiver Circular Buffer Enable          */
    uint32_t :1;                        /**< bit:     17  Reserved */
    uint32_t TXCBEN:1;                  /**< bit:     18  Transmitter Circular Buffer Enable       */
    uint32_t :5;                        /**< bit: 19..23  Reserved */
    uint32_t ERR:1;                     /**< bit:     24  Transfer Bus Error                       */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} UART_PTSR_Type;
