ataradov/mcu-starter-projects/samg53/include/component/uart.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define UART_PTSR_OFFSET                    (0x124)                                       /**<  (UART_PTSR) Transfer Status Register  Offset */

#define UART_PTSR_RXTEN_Pos                 0                                              /**< (UART_PTSR) Receiver Transfer Enable Position */
#define UART_PTSR_RXTEN_Msk                 (_U_(0x1) << UART_PTSR_RXTEN_Pos)              /**< (UART_PTSR) Receiver Transfer Enable Mask */
#define UART_PTSR_RXTEN                     UART_PTSR_RXTEN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_PTSR_RXTEN_Msk instead */
#define UART_PTSR_TXTEN_Pos                 8                                              /**< (UART_PTSR) Transmitter Transfer Enable Position */
#define UART_PTSR_TXTEN_Msk                 (_U_(0x1) << UART_PTSR_TXTEN_Pos)              /**< (UART_PTSR) Transmitter Transfer Enable Mask */
#define UART_PTSR_TXTEN                     UART_PTSR_TXTEN_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_PTSR_TXTEN_Msk instead */
#define UART_PTSR_RXCBEN_Pos                16                                             /**< (UART_PTSR) Receiver Circular Buffer Enable Position */
#define UART_PTSR_RXCBEN_Msk                (_U_(0x1) << UART_PTSR_RXCBEN_Pos)             /**< (UART_PTSR) Receiver Circular Buffer Enable Mask */
#define UART_PTSR_RXCBEN                    UART_PTSR_RXCBEN_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_PTSR_RXCBEN_Msk instead */
#define UART_PTSR_TXCBEN_Pos                18                                             /**< (UART_PTSR) Transmitter Circular Buffer Enable Position */
#define UART_PTSR_TXCBEN_Msk                (_U_(0x1) << UART_PTSR_TXCBEN_Pos)             /**< (UART_PTSR) Transmitter Circular Buffer Enable Mask */
#define UART_PTSR_TXCBEN                    UART_PTSR_TXCBEN_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_PTSR_TXCBEN_Msk instead */
#define UART_PTSR_ERR_Pos                   24                                             /**< (UART_PTSR) Transfer Bus Error Position */
#define UART_PTSR_ERR_Msk                   (_U_(0x1) << UART_PTSR_ERR_Pos)                /**< (UART_PTSR) Transfer Bus Error Mask */
#define UART_PTSR_ERR                       UART_PTSR_ERR_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use UART_PTSR_ERR_Msk instead */
#define UART_PTSR_MASK                      _U_(0x1050101)                                 /**< \deprecated (UART_PTSR) Register MASK  (Use UART_PTSR_Msk instead)  */
#define UART_PTSR_Msk                       _U_(0x1050101)                                 /**< (UART_PTSR) Register Mask  */


#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief UART hardware registers */
typedef struct {  
  __O  uint32_t UART_CR;        /**< (UART Offset: 0x00) Control Register */
  __IO uint32_t UART_MR;        /**< (UART Offset: 0x04) Mode Register */
  __O  uint32_t UART_IER;       /**< (UART Offset: 0x08) Interrupt Enable Register */
  __O  uint32_t UART_IDR;       /**< (UART Offset: 0x0C) Interrupt Disable Register */
  __I  uint32_t UART_IMR;       /**< (UART Offset: 0x10) Interrupt Mask Register */
  __I  uint32_t UART_SR;        /**< (UART Offset: 0x14) Status Register */
  __I  uint32_t UART_RHR;       /**< (UART Offset: 0x18) Receive Holding Register */
  __O  uint32_t UART_THR;       /**< (UART Offset: 0x1C) Transmit Holding Register */
  __IO uint32_t UART_BRGR;      /**< (UART Offset: 0x20) Baud Rate Generator Register */
  __IO uint32_t UART_CMPR;      /**< (UART Offset: 0x24) Comparison Register */
  RoReg8  Reserved1[0xBC];
  __IO uint32_t UART_WPMR;      /**< (UART Offset: 0xE4) Write Protection Mode Register */
  RoReg8  Reserved2[0x18];
  __IO uint32_t UART_RPR;       /**< (UART Offset: 0x100) Receive Pointer Register */
  __IO uint32_t UART_RCR;       /**< (UART Offset: 0x104) Receive Counter Register */
  __IO uint32_t UART_TPR;       /**< (UART Offset: 0x108) Transmit Pointer Register */
  __IO uint32_t UART_TCR;       /**< (UART Offset: 0x10C) Transmit Counter Register */
  __IO uint32_t UART_RNPR;      /**< (UART Offset: 0x110) Receive Next Pointer Register */
  __IO uint32_t UART_RNCR;      /**< (UART Offset: 0x114) Receive Next Counter Register */
  __IO uint32_t UART_TNPR;      /**< (UART Offset: 0x118) Transmit Next Pointer Register */
  __IO uint32_t UART_TNCR;      /**< (UART Offset: 0x11C) Transmit Next Counter Register */
  __O  uint32_t UART_PTCR;      /**< (UART Offset: 0x120) Transfer Control Register */
  __I  uint32_t UART_PTSR;      /**< (UART Offset: 0x124) Transfer Status Register */
} Uart;

#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief UART hardware registers */
typedef struct {  
  __O  UART_CR_Type                   UART_CR;        /**< Offset: 0x00 ( /W  32) Control Register */
  __IO UART_MR_Type                   UART_MR;        /**< Offset: 0x04 (R/W  32) Mode Register */
  __O  UART_IER_Type                  UART_IER;       /**< Offset: 0x08 ( /W  32) Interrupt Enable Register */
  __O  UART_IDR_Type                  UART_IDR;       /**< Offset: 0x0C ( /W  32) Interrupt Disable Register */
  __I  UART_IMR_Type                  UART_IMR;       /**< Offset: 0x10 (R/   32) Interrupt Mask Register */
  __I  UART_SR_Type                   UART_SR;        /**< Offset: 0x14 (R/   32) Status Register */
  __I  UART_RHR_Type                  UART_RHR;       /**< Offset: 0x18 (R/   32) Receive Holding Register */
  __O  UART_THR_Type                  UART_THR;       /**< Offset: 0x1C ( /W  32) Transmit Holding Register */
  __IO UART_BRGR_Type                 UART_BRGR;      /**< Offset: 0x20 (R/W  32) Baud Rate Generator Register */
  __IO UART_CMPR_Type                 UART_CMPR;      /**< Offset: 0x24 (R/W  32) Comparison Register */
  __I  uint32_t                       Reserved1[47];
  __IO UART_WPMR_Type                 UART_WPMR;      /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I  uint32_t                       Reserved2[6];
  __IO UART_RPR_Type                  UART_RPR;       /**< Offset: 0x100 (R/W  32) Receive Pointer Register */
  __IO UART_RCR_Type                  UART_RCR;       /**< Offset: 0x104 (R/W  32) Receive Counter Register */
  __IO UART_TPR_Type                  UART_TPR;       /**< Offset: 0x108 (R/W  32) Transmit Pointer Register */
  __IO UART_TCR_Type                  UART_TCR;       /**< Offset: 0x10C (R/W  32) Transmit Counter Register */
  __IO UART_RNPR_Type                 UART_RNPR;      /**< Offset: 0x110 (R/W  32) Receive Next Pointer Register */
  __IO UART_RNCR_Type                 UART_RNCR;      /**< Offset: 0x114 (R/W  32) Receive Next Counter Register */
  __IO UART_TNPR_Type                 UART_TNPR;      /**< Offset: 0x118 (R/W  32) Transmit Next Pointer Register */
  __IO UART_TNCR_Type                 UART_TNCR;      /**< Offset: 0x11C (R/W  32) Transmit Next Counter Register */
  __O  UART_PTCR_Type                 UART_PTCR;      /**< Offset: 0x120 ( /W  32) Transfer Control Register */
  __I  UART_PTSR_Type                 UART_PTSR;      /**< Offset: 0x124 (R/   32) Transfer Status Register */
} Uart;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of Universal Asynchronous Receiver Transmitter */

#endif /* _SAMG53_UART_COMPONENT_H_ */
